In [16]:
import pandas as pd
import json
import requests
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import pprint as pp

In [5]:
APIyelp = "PnCaCClu_oaMrigxA4QIQILSm_-IZtvKAJur803egyHClYLF1A93_cEYvgBY8Na2fpa65VSTjDtofak2coDyz3iUCQHuhL6Y3rRN6mnfIBzRhgKLu5bwmzq6A_8CYXYx"

In [39]:
table1 = pd.read_csv("hispanicData.csv")
table1.head()

,Unnamed: 0,code,total_POP,nonHispanic_POP,latitude,longitude,NAME,Hispanic_POP,Percent_Hispanic
0,0,AK,731545,678333,63.588753,-154.493062,Alaska,53212,0.072739
1,1,AL,4903185,4679907,32.318231,-86.902298,Alabama,223278,0.045537
2,2,AR,3017804,2781173,35.201050,-91.831833,Arkansas,236631,0.078412
3,3,AZ,7278717,4968127,34.048928,-111.093731,Arizona,2310590,0.317445
4,4,CA,39512223,23937343,36.778261,-119.417932,California,15574880,0.394179

In [41]:
states = table1["NAME"].tolist()
states

['Alaska',
 'Alabama',
 'Arkansas',
 'Arizona',
 'California',
 'Colorado',
 'Connecticut',
 'District of Columbia',
 'Delaware',
 'Florida',
 'Georgia',
 'Hawaii',
 'Iowa',
 'Idaho',
 'Illinois',
 'Indiana',
 'Kansas',
 'Kentucky',
 'Louisiana',
 'Massachusetts',
 'Maryland',
 'Maine',
 'Michigan',
 'Minnesota',
 'Missouri',
 'Mississippi',
 'Montana',
 'North Carolina',
 'North Dakota',
 'Nebraska',
 'New Hampshire',
 'New Jersey',
 'New Mexico',
 'Nevada',
 'New York',
 'Ohio',
 'Oklahoma',
 'Oregon',
 'Pennsylvania',
 'Rhode Island',
 'South Carolina',
 'South Dakota',
 'Tennessee',
 'Texas',
 'Utah',
 'Virginia',
 'Vermont',
 'Washington',
 'Wisconsin',
 'West Virginia',
 'Wyoming']

In [47]:
MexicanRestaurants = []


for state in states:
    headers = {'authorization': 'Bearer {}'.format(APIyelp)}
    search_api_url = 'https://api.yelp.com/v3/businesses/search'
    params = {  'term': 'mexican',
                'location': state,
                'rating': 5,
                'limit': 50
            }
    r =requests.get(search_api_url, headers=headers, params=params, timeout=5)
    MexicanRestaurants.append(r.json())

TotalMexicanRestaurants = MexicanRestaurants

In [51]:
with open('restaurants.json', 'w') as outfile:
    json.dump(TotalMexicanRestaurants, outfile)